In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("studentinfo.csv")

In [3]:
df

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
0,77,90.0,71,90.0,2018,3
1,72,79.0,70,84.0,2018,2
2,80,81.0,71,92.0,2020,3
3,67,89.0,74,79.0,2019,2
4,75,81.0,66,89.0,2021,3
...,...,...,...,...,...,...
84,65,87.0,65,88.0,2021,3
85,66,93.0,67,96.0,2019,3
86,68,89.0,80,81.0,2020,2
87,72,94.0,70,79.0,2018,2
88,73,88.0,75,75.0,2020,2

In [4]:
df.describe

<bound method NDFrame.describe of     Math_Score  Reading_Score  Writing_Score  Placement_Score  Club_Join_Date  \
0           77           90.0             71             90.0            2018
1           72           79.0             70             84.0            2018
2           80           81.0             71             92.0            2020
3           67           89.0             74             79.0            2019
4           75           81.0             66             89.0            2021
..         ...            ...            ...              ...             ...
84          65           87.0             65             88.0            2021
85          66           93.0             67             96.0            2019
86          68           89.0             80             81.0            2020
87          72           94.0             70             79.0            2018
88          73           88.0             75             75.0            2020

    placement_offer
0                 3
1                 2
2                 3
3                 2
4                 3
..              ...
84                3
85                3
86                2
87                2
88                2

[89 rows x 6 columns]>

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Math_Score       89 non-null     int64
 1   Reading_Score    84 non-null     float64
 2   Writing_Score    89 non-null     int64
 3   Placement_Score  81 non-null     float64
 4   Club_Join_Date   89 non-null     int64
 5   placement_offer  89 non-null     int64
dtypes: float64(2), int64(4)
memory usage: 4.2 KB

In [6]:
df.isnull()

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
84,False,False,False,False,False,False
85,False,False,False,False,False,False
86,False,False,False,False,False,False
87,False,False,False,False,False,False
88,False,False,False,False,False,False

In [15]:
series=pd.isnull(df["Reading_Score"])

In [16]:
df[series]

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
19,65,NaN,80,95.0,2021,3
20,78,NaN,67,99.0,2018,3
21,70,NaN,68,75.0,2019,2
22,67,NaN,70,91.0,2021,3
23,76,NaN,78,96.0,2018,3

In [12]:
df.notnull()

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
0,True,True,True,True,True,True
1,True,True,True,True,True,True
2,True,True,True,True,True,True
3,True,True,True,True,True,True
4,True,True,True,True,True,True
...,...,...,...,...,...,...
84,True,True,True,True,True,True
85,True,True,True,True,True,True
86,True,True,True,True,True,True
87,True,True,True,True,True,True
88,True,True,True,True,True,True

In [21]:
series1=pd.notnull(df["Reading_Score"])

In [22]:
df[series1]

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
0,77,90.0,71,90.0,2018,3
1,72,79.0,70,84.0,2018,2
2,80,81.0,71,92.0,2020,3
3,67,89.0,74,79.0,2019,2
4,75,81.0,66,89.0,2021,3
...,...,...,...,...,...,...
84,65,87.0,65,88.0,2021,3
85,66,93.0,67,96.0,2019,3
86,68,89.0,80,81.0,2020,2
87,72,94.0,70,79.0,2018,2
88,73,88.0,75,75.0,2020,2

In [23]:
ndf=df

In [35]:
y=ndf.fillna(0,inplace=True)

In [27]:
series=pd.isnull(ndf["Reading_Score"])

In [28]:
ndf[series]

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
19,65,NaN,80,95.0,2021,3
20,78,NaN,67,99.0,2018,3
21,70,NaN,68,75.0,2019,2
22,67,NaN,70,91.0,2021,3
23,76,NaN,78,96.0,2018,3

In [29]:
missing_values = ["Na", "na"]

In [30]:
df = pd.read_csv("studentinfo.csv", na_values=missing_values)

In [31]:
df

,Math_Score,Reading_Score,Writing_Score,Placement_Score,Club_Join_Date,placement_offer
0,77,90.0,71,90.0,2018,3
1,72,79.0,70,84.0,2018,2
2,80,81.0,71,92.0,2020,3
3,67,89.0,74,79.0,2019,2
4,75,81.0,66,89.0,2021,3
...,...,...,...,...,...,...
84,65,87.0,65,88.0,2021,3
85,66,93.0,67,96.0,2019,3
86,68,89.0,80,81.0,2020,2
87,72,94.0,70,79.0,2018,2
88,73,88.0,75,75.0,2020,2